name: "3Dexample"
layer {
  name: "dummy"
  type: "DummyData"
  top: "data"
  top: "label"
  dummy_data_param{
    shape {dim: 1 dim:3 dim:2 dim:3 dim:4}
    shape {dim: 1}
    data_filler: {type: 'gaussian' std: 5}
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 3
    axis: 1
    kernel_size: 3
    kernel_size: 3
    kernel_size: 3
    pad: 1
    pad: 1
    pad: 1
    engine: CAFFE
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
  relu_param {
    engine: CAFFE
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    stride: 1
    kernel_size: 2
    engine: CAFFE
  }
}
#layer {
#  name: "fc2"
#  type: "InnerProduct"
#  bottom: "conv1"
#  top: "fc2"
#  inner_product_param {
#    num_output: 1
#  }
#}
#layer {
#  name: "loss"
#  type: "SoftmaxWithLoss"
#  bottom: "fc2"
#  bottom: "conv1"
#  bottom: "label"
#  top: "loss"
#}
